# текст на русском

ru_text = {
    'help':'\nПомощь по боту '
           '\nРазделы: '
           '\nℹ!mhelp - Основная информация '
           '\n📄!chelp - Команды бота '
           '\n✏!shelp - Помощь по стилям временных меток '
           '\n🚫!ehelp - Частые ошибки',
    'mhelp':'\nБот предназначен для создания временных меток следующего типа - <t:1656667800:f> '
            '\nТакая метка будет правильно отображаться у всех пользоваетелей, если часовой пояс '
            'установлен правильно '
            '\nБот работает как на сервере, так и в личных сообщениях',
    'chelp':'\nДля выбора часового пояса введите !utс "часовой пояс" '
            '\nПример: !utc +2 '
            '\nДля получения временной метки, используйте !time "год" "месяц" "день" "час" "минута" '
            '\nПример: !time 2022 01 06 15 20 '
            '\n чтобы ее использовать, надо скопировать полученный от бота '
            'текст и вставить в нужный чат',
    'shelp:':'\nУ временных меток в дискорде есть 7 стилей отображения. '
             '\nВнизу указан символ который надо указывать в !style, и пример отображения'
             '\nt   <t:1656667800:t> '
             '\nT  <t:1656667800:T> '
             '\nd  <t:1656667800:d> '
             '\nD <t:1656667800:D> '
             '\nf   <t:1656667800:f> '
             '\nF  <t:1656667800:F> '
             '\nR  <t:1656667800:R>',
    'ehelp':'\nP - ошибка '
            '\nS - возможное решение '
            '\nP: дата/время оттображается не правильно '
            '\nS: проверте часовой пояс, !utc; стиль ,!style '
            '\nS²: проверте правильно ли вы ввели дату и время команды !time, !chelp '
            '\nP: при вводе какой либо команды ничего не проискходит '
            '\nS: проверьте правильно ли вы вводите команду '
            '\nS²: возможно бот отключен. Статус можно проверить в профиле '
            '\nP: любая другая ошибка '
            '\nS: обратитесь ко мне в личные сообщения Segonist#4356'
}

# english text

# en_text = {
#     'help':,
#     'mhelp':,
#     'chelp':,
#     'shelp':,
#     'ehelp':
# }
